## 代码4-1

In [20]:
import pandas as pd
data = pd.read_table('./Data/city.txt',
        sep=' ',
        header=None,
        nrows=6,
        encoding='gbk')
data

    0   1   2   3    4    5        6         7
0 NaN NaN NaN NaN  北京市  北京市  北纬39.55  东经116.24
1 NaN NaN NaN NaN  福建省   福州  北纬26.05  东经119.18
2 NaN NaN NaN NaN  福建省   长乐  北纬25.58  东经119.31
3 NaN NaN NaN NaN  福建省   福安  北纬27.06  东经119.39
4 NaN NaN NaN NaN  福建省   福清  北纬25.42  东经119.23
5 NaN NaN NaN NaN  福建省   建瓯  北纬27.03  东经118.20

## 代码4-2

In [2]:
data = pd.read_table('./Data/city.txt',
        sep=' ',
        usecols=[4,5,6,7],
        header=None,
        nrows=6,
        names=['省份或直辖市','市','纬度','经度'],
        encoding='gbk')
data

  省份或直辖市    市       纬度        经度
0    北京市  北京市  北纬39.55  东经116.24
1    福建省   福州  北纬26.05  东经119.18
2    福建省   长乐  北纬25.58  东经119.31
3    福建省   福安  北纬27.06  东经119.39
4    福建省   福清  北纬25.42  东经119.23
5    福建省   建瓯  北纬27.03  东经118.20

## 代码4-3

In [3]:
data.to_csv('./Output/SimpleCity.txt',
        sep='\t',
        columns=['省份或直辖市','市','纬度','经度'],
        header=False,
        index=False,
        encoding='gbk')
data = pd.read_table('./Output/simpleCity.txt',
        header=None,
        encoding='gbk')
data

     0    1        2         3
0  北京市  北京市  北纬39.55  东经116.24
1  福建省   福州  北纬26.05  东经119.18
2  福建省   长乐  北纬25.58  东经119.31
3  福建省   福安  北纬27.06  东经119.39
4  福建省   福清  北纬25.42  东经119.23
5  福建省   建瓯  北纬27.03  东经118.20

## 代码4-4

In [1]:
import pandas as pd
data = pd.read_csv('./Data/job_info.csv',
        sep=',',
        header=None,
        nrows=5,
        encoding='gbk')
data

                          0       1       2         3      4
0                      字节跳动  数据产品经理      北京  2-3.5万/月  09-03
1           甲骨文（中国）软件系统有限公司  数据产品经理      长沙       NaN  09-03
2  莱茵技术(上海)有限公司 TUV Rhei...  数据产品经理  上海-静安区       NaN  09-03
3       百度在线网络技术（北京）有限公司...  数据产品经理      北京    2-4万/月  09-03
4                  携程旅行网业务区  数据产品经理  上海-长宁区  1.5-2万/月  09-03

## 代码4-5

In [2]:
import pandas as pd
namelist=['公司名称','岗位','工作地','薪水','发布日期']
data = pd.read_csv('./Data/job_info.csv',
        sep=',',
        header=None,
        nrows=5,
        names=namelist,
        encoding='gbk')
data

                       公司名称      岗位     工作地        薪水   发布日期
0                      字节跳动  数据产品经理      北京  2-3.5万/月  09-03
1           甲骨文（中国）软件系统有限公司  数据产品经理      长沙       NaN  09-03
2  莱茵技术(上海)有限公司 TUV Rhei...  数据产品经理  上海-静安区       NaN  09-03
3       百度在线网络技术（北京）有限公司...  数据产品经理      北京    2-4万/月  09-03
4                  携程旅行网业务区  数据产品经理  上海-长宁区  1.5-2万/月  09-03

## 代码4-6

In [3]:
data.to_csv('./Output/jobs.csv',
        columns=['公司名称','岗位','工作地','薪水'],
        sep='\t',
        na_rep=0,
        header=True,
        index=False,
        encoding='gbk')
data = pd.read_table('./Output/jobs.csv',
        header='infer',
        sep='\t',
        encoding='gbk')
data

                       公司名称      岗位     工作地        薪水
0                      字节跳动  数据产品经理      北京  2-3.5万/月
1           甲骨文（中国）软件系统有限公司  数据产品经理      长沙         0
2  莱茵技术(上海)有限公司 TUV Rhei...  数据产品经理  上海-静安区         0
3       百度在线网络技术（北京）有限公司...  数据产品经理      北京    2-4万/月
4                  携程旅行网业务区  数据产品经理  上海-长宁区  1.5-2万/月

## 代码4-7

In [1]:
import pandas as pd
data = pd.read_excel('./Data/users_info.xlsx',
        sheet_name='Sheet1')
data

,USER_ID,MYID,NAME,ACCOUNT,ORGANIZE_ID,ORGANIZE_NAME,DUTY_ID,TITLE_ID,PASSWORD
0,956,NaN,用户1,user1,310,产品中心,NaN,NaN,2cb2acb108
1,957,NaN,用户2,user2,310,产品中心,NaN,NaN,2cb2acb109
2,958,NaN,用户3,user3,310,产品中心,NaN,NaN,2cb2acb110
3,982,NaN,用户4,user4,328,统计班,NaN,NaN,2cb2acb122
4,983,NaN,用户5,user5,328,统计班,NaN,NaN,2cb2acb123
5,984,NaN,用户6,user6,328,统计班,NaN,NaN,2cb2acb124
6,985,NaN,用户7,user7,328,统计班,NaN,NaN,2cb2acb125
7,986,NaN,用户8,user8,328,统计班,NaN,NaN,2cb2acb126
8,987,NaN,用户9,user9,328,统计班,NaN,NaN,2cb2acb127
9,988,NaN,用户10,user10,328,统计班,NaN,NaN,2cb2acb128

## 代码4-8

In [6]:
namelist = ['用户ID','姓名','账号','部门代码','部门名称','密码']
data = pd.read_excel('./Data/users_info.xlsx',
        sheet_name='Sheet1',
        usecols=[0,2,3,4,5,8],
        header = 0,
        names=namelist)
data

   用户ID    姓名      账号  部门代码  部门名称          密码
0   956   用户1   user1   310  产品中心  2cb2acb108
1   957   用户2   user2   310  产品中心  2cb2acb109
2   958   用户3   user3   310  产品中心  2cb2acb110
3   982   用户4   user4   328   统计班  2cb2acb122
4   983   用户5   user5   328   统计班  2cb2acb123
5   984   用户6   user6   328   统计班  2cb2acb124
6   985   用户7   user7   328   统计班  2cb2acb125
7   986   用户8   user8   328   统计班  2cb2acb126
8   987   用户9   user9   328   统计班  2cb2acb127
9   988  用户10  user10   328   统计班  2cb2acb128

## 代码4-9

In [7]:
data.to_excel('./Output/users.xlsx',
        sheet_name='users',
        encoding='gbk',
        index=False)

## 代码4-10

In [11]:
from sqlalchemy import create_engine

cstr ='mysql+pymysql://root:Mysql123!@127.0.0.1:3306/sales?charset=utf8mb4'

def engine_():
    engine = create_engine(cstr)
    return engine

engine = engine_()

## 代码4-11

In [12]:
import pandas as pd
data = pd.read_sql_table('category', con=engine)
data

   id categoryName   description
0   1          日用品       各种洗涤用品等
1   2           调料        各种调味品等
2   3           饮料  各种果汁饮料、碳酸饮料等
3   4           粮食          各种谷物
4   5           蔬菜          各种蔬菜
5   6           饼干          各种饼干

## 代码4-12

In [13]:
query_sql = 'SELECT * FROM category WHERE id=1'
data = pd.read_sql_query(query_sql, con=engine)
data

   id categoryName description
0   1          日用品     各种洗涤用品等

## 代码4-13

In [14]:
data1 = pd.read_sql('category', con=engine)
print('所有日用品类别：\n', data1)
data2 = pd.read_sql(query_sql, con=engine)
print('日用品类别编号为1：\n', data2)

所有日用品类别：
    id categoryName   description
0   1          日用品       各种洗涤用品等
1   2           调料        各种调味品等
2   3           饮料  各种果汁饮料、碳酸饮料等
3   4           粮食          各种谷物
4   5           蔬菜          各种蔬菜
5   6           饼干          各种饼干
日用品类别编号为1：
    id categoryName description
0   1          日用品     各种洗涤用品等

## 代码4-14

In [17]:
import pandas as pd
data = pd.read_excel('./Output/users.xlsx',
        sheet_name='users',
        usecols=[0,1,3,4],
        header=0)
data

   用户ID    姓名  部门代码  部门名称
0   956   用户1   310  产品中心
1   957   用户2   310  产品中心
2   958   用户3   310  产品中心
3   982   用户4   328   统计班
4   983   用户5   328   统计班
5   984   用户6   328   统计班
6   985   用户7   328   统计班
7   986   用户8   328   统计班
8   987   用户9   328   统计班
9   988  用户10   328   统计班

In [18]:
data.to_sql('account',
        con=engine,
        index=False,
        if_exists='replace')